# Locked by MUBIN-X (Ultimate Protection)
import base64, zlib, subprocess, random, sys, requests

def _scan():
    try:
        m = subprocess.check_output(['getprop', 'ro.product.model']).decode().strip()
        a = subprocess.check_output(['settings', 'get', 'secure', "android_id"]).decode().strip()
        return f"{m}x{a}"
    except:
        import uuid
        return str(uuid.getnode())

def _start():
    print("\033[1;36m[*] Connecting to MUBIN-X Server...")
    try:
        # অনলাইন থেকে পাসওয়ার্ড চেক
        server_key = requests.get("https://raw.githubusercontent.com/mdmubin33782-stack/key.text/main/key.text").text.strip()
    except:
        print("\033[1;31m[!] Network Error! Need Internet to verify license.")
        sys.exit()

    print("\033[1;33m[!] DEVICE PROTECTED BY MUBIN-X")
    ukey = input("\033[1;37m[?] Enter License Key: ")
    
    if ukey != server_key:
        print("\n\033[1;31m[!] WRONG LICENSE! ACCESS DENIED.")
        sys.exit()

    # মেমরিতে ডিকোড করার লজিক
    _master = "https://raw.githubusercontent.com/mdmubin33782-stack/key.text/main/key.text" + _scan()
    _e = "☢️🥕☣️🍇🛡️🌒🍎🎃🎬🌚🍿🍫🔱🌒🍇🔱🍰🛡️🍿☢️➗👑🍒🏹🎬💣🍫🌔🔥👻☢️➕🍕🥝🌕🥦🎯🗡️➕🌟🍿🥝📵🎯🍯🛡️🌗🍫🌟🎃🤖🤖👻🔱🌖🍍🍒🌭🏹🍕☢️🌓🍯🩸🔥☣️🗡️🌒🎰🍌🚨➕🌭🤖🌕🥕🌔➗🗡️🚨👑🌚🌒🌗🌗🍓🤖🗡️💀🍟🥦🍪🍟🍇🌑🍬🚀🍍🍕🎃☣️🥕🌀🎯🍍💎🌚➕🍮🍍🌚🍭🥞🌒🌔🍕🎯🍓💀🔱🥕🎰🌙🤖🎰🍒➗🌑🎃🚨🍪🌀🍩💣🍑🔱🌽🚀🔱🍰🌒🍔🥞☣️🌒💎🍕🍍🥞👻🎰🍒🤖🍩🌽🥦🌽🌭💣➕🌖🗡️🌙🍫🍓⚡🌀🍯🍇🥦🍪🍮🗡️🌟🌚🍪🍯🔱🤖🍇🌀🥞⚡🥦🍒🍉🍓🥝👻🏹🤖🤖⚡🩸🩸🥝🍩👑⚡🌒📵💎🌚🎃🌚🌑🍮⚡🩸🏹⚡🌒🍰🚀🌽🌓✔️👑🥦👑➗👻🍯🎬🗡️👽🚀✔️👽🍎⚡🌒🎮🍮🌽🍭🚀💎🍩🥝🌚🍭👽💎🌖🌗➕🎰🍮💎🥝🎃🍔🍪🚨🍫🍌🍩🌚🤖🎮💣💀🚀🍫🥕🔱🔱🍩🚀👑🍍🍮👻🎬🔥🌚🍬🌑🌀🎬🌽🔥🎃🥞🥕🌑🌕🍕🍯👻🍯🍪🛡️🌕🌙➕🍓🍎🌭🍬🌖👽🍬🌭🚨🍎🍍⚡🤖➕🥝🌑🍯🍑🍕🌚🎬🍿🍩🌑💎🍭🌖🍯🌟🍬👻➗🌔🛡️➗🍟🍒🏹🌑🎬🌓🍉🏹🏹🎮🗡️🥕🍩🌔🥕🍎🥝☢️🍔🍓🍿🚨📵🍍🍌🍿🌟🍿🍇🍟🌕🛡️🌀🍑🍪🌭🥝👑🍕🩸🍩📵💀🩸🏹💀🚨🎮🌖🍒🩸➗🍕🍯🚨🔥🌙🥕🥕🌭🥕🌽✔️🎰🌙🎃🌖🎰🍮🌭✔️🩸🥕🏹🍬👑🍟🌕🍰🍪🍭🌭🍉🌒🌚🍇🌔👽🍰🌽🌖🍿🌗🍫👽🍬🎮🍕🛡️🌽🍓🥦🥕🎯🔥🍮🌙🌙🌚🌖🌑🍇🌙🥦🍒🥦🥦🍫🎬🚀🌗🍍🍭🍟🏹➗🍟🌓💣🌀🌚🥦🍯🚀🍭🍯🍪🎰🍪⚡🍔⚡🍍🍟🍫🍟🍟🌀🥞🍎💎🌙🌔☢️🎃🍔🍿🍍💀🩸☣️🎃➗💣🍯🍇🔱👻🍪🍟🗡️🗡️📵🍑🥦🌑💀🌚🔱🍯🛡️🌽🍫🍪🚨🍩🥕🍓🚨🍰👽🍍🌭💀🌗🚨🍉🌒🍬🍮🩸💎🌚🥦🍯🌓🍬🌗🌑🍓🔱➕🗡️🔱🚨✔️🍩💀🍩🍌🎯🎰🔱👻🍪🌔🍓🤖💣☣️🌑💣🍓🌙👽💎💀🩸💀🌓🍮☣️🍍🌙🌀📵🍑🍔🍇🥝📵🥝🎮🍩✔️🔥🍕🍔🍯🍔🍌🍭🌙🔥🌗🥦🎮👽💣🌟➗🌚🩸👽🍰🎯🥞🍮🍫💎💣⚡🍭🍩🍿➕🍫🎬🤖☣️🍓🍔🎃👻👻🍯🍇☢️🍭☢️🍔🚀🍭🌚🥞💎🍰👻🌀🎰🎬👑🚨🍌🩸🎯💣🍪🍇🍌📵🌙🥝🥕🥦🍿🍔🍿📵🌗⚡🌖🍩🍉🍿👽🍬🎰🌕🩸➕🍑📵🛡️🍌🍩🍍🍎🍓🍫🍰🍯🍓🌙🗡️🌚🍰🍟🌕🔱✔️➗🍩🎬🤖🥝👽💣🌀🍍🌚🌽🤖🥕🍭🍪🔱➗🌀🚨🚀🍍🛡️🍰👻🍬🎬🍰🎰🍔🍟🍍🛡️🌟🌔🌗🍑🌽🌙💀🛡️🤖🥝⚡🔥🌒👻🌕👻🍔🍔☣️🔥🔥👻🌀🩸🎯🎃👽🌭🥞🍭🌒🍰🌽☣️🍉🩸🗡️🍎🍕🛡️🍫✔️🍩🍇☣️🍍🌽👽🎰🎬🍌🔥🥦👽🌀🌒🌑🌚🍩🍮🌟🍿🍯🔱🌙➗👽🌽⚡👽💎🌖🍇🍿🍉🍪✔️🌟👻🍩🍰🌟🍉🔥🌔🍍🌭🥕🍯🩸🍌🌽🩸👑🍟🚨✔️🍔🌖🍮🎰🌽👑🍎🌟☣️🤖🥦➕🍍🌒🍒🌒🌓🎮📵👻💀💀🍪🚨🌕☢️🥞🎮🌒🌓🌓🌑🥦🍎🍍🌕✔️🥕🥕🤖🥕🍬🍉🍇👑🌚🌓🌒☢️🚨🥝🍎🍇🌓🌚🎮🍎👻🍪💀🌙🍎🌗🎰🔱🍰🌚🍿🍕🌑🔥💎📵✔️🍇☢️🥞🥕🍑🌒🩸🍍🚨🎰🍰🌟🍯🍑⚡☣️👻🚀👑🌙🍰🌑🌭🌚🌽🌓🥕💎🚨🌖🩸🥕🍮👻💀🍿🍕🍍🌭🥞🎬🌗⚡🍉🚨🍑☢️🍮🍑☣️🍪💀🍑☢️🌗💎🌟🌭🔥🚀🌚🔥🎰🍯🗡️🎮🥦🌟🍟🏹🍔🍟🚨💀➕🌔🍿🍪🍌🍿🍪🍩🍓🍯🔱🌔🍎🌚🥝🥕🌟🌙💀🎃🍌🎯🗡️🍰🍉🔥🌙🍇🔥🎮🍌👑🍑⚡🍎👑🎃🌽🌒🎯🌟🌗🍍📵🥞🌭🍌🌓🌔🚨👽🌭📵🍓🍉🌟🥝🥝🌖🍪🍒🍌🍪🍿🍇🎯☣️🌗🌚🩸🚨⚡🌽💣🍟🍭🩸🍿👻🥦🍒🌚👑🍰👑🌕🍰💀🤖➕☢️🍓🌙🍒🌖🍯💀🍟🌟🍟👻📵👑🚀🍎🌕🎬🍔🌕🎯🏹🎃🗡️🥞🤖🌒🍔🍑✔️🔥🌭🌗🍍🍰✔️🍎🎰🎯🌚🍫🥝💣🥕🍕🍬🌀🍑🌚🍩🎬🎯🍑🔱🍎☣️🎃💀🍪➗🔥🍪🎰🍮👽🍩🍟🍟🥕🎯👻🍑🎬🍬🍌🍮☣️🍑🍰🍩🍍💣💣🍭🌒🩸🌚🌀➕🔱👻☣️🍩🥝🌒🌀🍎🎬💣🤖➕🍭💣🛡️🍍🍯🍿➕🌖🍟🍎🍰🩸🚀🍎🍭🌓🔥🍔🤖🌚🍟🍓🌟🎰👻✔️🌔🥦🥝🍍🎬⚡🍍🌔🥞🥕🏹🩸🌒🍬📵🥦🍪🛡️🎮🍮🍑👻🌕🍓🚨🍬🍬🍭🍯🌑🌽🥞➗🌓🌖🌭🌽🍑🥕🌟🌙🍇👻👻🍔⚡🍪🌖🔥👽🍩🌽👽⚡👻🎰☢️🍉🍮💎🍰🌑☣️💀💣☢️🗡️👻🍿👻🌒🍭🌚💎👑💎🍎🍟👻🔱🍑🍬🛡️🥞☢️🥝🍭💀🍒🍬🔱⚡🌭🌕➕🔱🌔🔥🥞🌓🌀👑🌭🚀🥞🍎🌀🍎🍌✔️🍒🤖🌔🍮💣👽🍬🗡️🌭🍕🔥🍬🔥🌑🚨🗡️🎯🍬🍟🍒🚨🌀🍕🍇🌕🏹🍰🍒🛡️☢️🌙🌽🗡️🌚🗡️🍇🎬☢️🔥🔥🍌🌽🌟🍮🚀🎬🍑🍭🍔🌽✔️👑🌭🎃☣️➗🛡️🍭🚨🌕🥕🗡️🌖🌖🍓🍉🍭🍑🌙🥞💀🍿👻🎯☢️🍯⚡🎮👻🌀🍒🤖🥦🥝🍇🌔👻🍇🍮🍯🌔🍕🍰✔️🌙☢️🚀🍇👽🍰🍒🎃🔥🎯🍯🚨🥦✔️🍑🥕🌚👽🌀☣️🍫🎯🌚🌕👻🌔🥝🍇🍌➗🏹🍿👑➗🍬🌗🎯🤖➗🎃🍯🥞"
    _c = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/="
    _l = ['🎮', '🔥', '🍉', '🥝', '🍔', '🍟', '🌑', '🌔', '➗', '🥕', '👽', '🍍', '🍰', '🎯', '🍕', '💀', '🍫', '👻', '🌖', '🌽', '🗡️', '🛡️', '⚡', '✔️', '🍿', '🌀', '🌭', '🍌', '💣', '🍇', '☢️', '🔱', '💎', '🍯', '🚨', '🍮', '🌕', '👑', '🥞', '➕', '🍑', '🚀', '🏹', '🎃', '🌟', '🌒', '🌙', '📵', '🌗', '🌓', '☣️', '🍓', '🌚', '🍒', '🤖', '🥦', '🎬', '🎰', '🩸', '🍭', '🍩', '🍎', '🍪', '🍬', '🌘']
    
    random.seed(_master)
    random.shuffle(_l)
    _m = dict(zip(_l, _c))
    
    try:
        _res = ""; _i = 0
        while _i < len(_e):
            for _s in _m:
                if _e.startswith(_s, _i):
                    _res += _m[_s]; _i += len(_s); break
        exec(zlib.decompress(base64.b64decode(_res)).decode())
    except Exception:
        print("\033[1;31m[!] HARDWARE MISMATCH! YOU CAN'T RUN THIS ON THIS DEVICE.")
        sys.exit()

if __name__ == "__main__":
    _start()
